
# ------------------------------------------------------------------------------------------
# настройки для генерации поля вспомогательной пульсационной скорости на равномерной сетке
# ------------------------------------------------------------------------------------------
i_cnt = 30   # количество ячеек в направлении орта i
j_cnt = 30   # количество ячеек в направлении орта j
k_cnt = 30   # количество ячеек в направлении орта k
grid_step = 0.001   # шаг сетки в м
l_e = 0.003   # размер наиболее энергонесущих вихрей
viscosity = 2e-5   # молекулярная вязкость
dissipation_rate = 6e3   # степень диссипации
alpha = 0.01   # константа для определения набора волновых чисел
u0 = 0  # характерная скорость
time = 0  # параметр времени

